export const verbQuestions = [
  "소스테스트 (SAUCE) 첫번째는 ‘시작 동사’입니다. 지원자님은 일 또는 아이디어를 진행할 때 어떤 ‘동사’를 기반으로 시작하나요? 포괄적이지만 자신의 일의 성향을 나타내는 동사를 골라보세요.",
  "두 번째는 ‘발전 동사’를 고를 차례입니다. 일 또는 아이디어를 시작하고 구체화,발전시킬 때 어떤 ‘동사’를 중심으로 하시나요? 정답은 없습니다. 자신에게 익숙한 동사를 골라보세요. ",
  "세 번째는 ‘기술 동사’입니다. 앞서 시작하고 발전시킨 일을 현실화 시킬 때 어떤 ‘동사’를 이용하시나요? 가장 본인이 자신있어 하는 동사를 골라보세요.",
  "네 번째 ‘소통 동사’입니다. ‘시작-발전-기술 동사로 진행 된 일이나 아이디어를 어떤 방식으로 전달, 소통하고 싶으신가요? 과거의 모습을 생각해보시고 골라보세요.",
  "마지막입니다. ‘결과 동사’를 고르시면 됩니다. 모든 과정을 지나 ‘마지막’이 어떤 모습일 때 가장 만족감이 높으실까요?",
];

export const keyword = [
  { name: "기준윤리형", keyword: ["책임감", "원칙주의", "정직성"] },
  { name: "기준심미형", keyword: ["감성적", "혁신적", "직관적"] },
  { name: "예술느낌형", keyword: ["독창성", "표현력", "자유로움"] },
  { name: "예술융합형", keyword: ["다양성", "실험정신", "융합성"] },
  { name: "이해관리형", keyword: ["체계적", "신중함", "성실성"] },
  { name: "이해연구형", keyword: ["논리중심", "객관성", "탐구열정"] },
  { name: "소통도움형", keyword: ["협력적", "적응력", "감성인지"] },
  { name: "소통조화형", keyword: ["중재력", "인내심", "안정감"] },
  { name: "도전확장형", keyword: ["모험적", "전략적", "주도적"] },
  { name: "도전목표형", keyword: ["추진력", "영향력", "효율성"] },
];
