export const testArr = [
  {
    sort: "기준 윤리형",
    name: "기준형",
    questions: [
      {
        text: "나는 업무를 수행할 때 내가 설정한 윤리적 기준을 가장 중요하게 여긴다.",
        score: 0,
      },
      {
        text: "나는 회사의 평가보다는 내가 설정한 원칙과 가치관에 따라 업무를 수행하려고 노력한다.",
        score: 0,
      },
      {
        text: "나는 업무 상황에서 옳고 그름을 구분하는 것이 자연스럽다.",
        score: 0,
      },
      {
        text: "나는 업무 관련 윤리적 판단을 내리는 데 주저함이 없으며, 이는 내 업무 수행의 근간이 된다.",
        score: 0,
      },
      {
        text: "나는 업무 수행 시 나만의 체계적인 루틴과 절차를 따른다.",
        score: 0,
      },
      {
        text: "나는 체계적인 업무 습관이 업무 효율성을 높여준다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 직장에서 부당하거나 불공정한 상황을 마주하면 강한 거부감을 느낀다.",
        score: 0,
      },
      {
        text: "나는 때때로 직장 내 정의를 위해 목소리를 내야 한다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무 중 발견한 문제점을 해결하는 데 헌신한다.",
        score: 0,
      },
      {
        text: "나는 업무상 문제라고 판단한 사안에 대해서는 해결될 때까지 끈기 있게 노력한다.",
        score: 0,
      },
      {
        text: "나는 때로는 업무 수행 시 융통성이 부족하다는 평가를 받는다.",
        score: 0,
      },
      {
        text: "나는 업무 원칙을 고수하는 것이 경직되게 보일 수 있다는 것을 알지만, 이는 나의 직업윤리 표현이라고 생각한다.",
        score: 0,
      },
      {
        text: "나에게 책임감과 꾸준함은 가장 중요한 직업적 덕목이다.",
        score: 0,
      },
      {
        text: "나는 맡은 업무에 최선을 다하고, 업무 관련 약속을 지키는 것을 기본으로 여긴다.",
        score: 0,
      },
      {
        text: "나에게 공정성은 핵심적인 업무 가치이다.",
        score: 0,
      },
      {
        text: "나는 직장에서 모든 구성원이 평등하고 공정한 대우를 받는 환경을 만들기 위해 노력한다.",
        score: 0,
      },
      {
        text: "나는 체계적이고 조직적인 방법을 활용하여 업무를 효율적으로 관리한다.",
        score: 0,
      },
      {
        text: "나는 업무 수행 시 항상 최상의 결과를 도출하기 위해 노력한다.",
        score: 0,
      },
    ],
    start: "인식하다",
    advance: ["판정하다", "검토하다"],
    utility: ["조직하다", "숙달하다"],
    communicate: ["안내하다", "지도하다"],
    expert: ["개선하다", "완수하다"],
  },
  {
    sort: "기준 심미형",
    name: "기준형",
    questions: [
      {
        text: "나는 업무 수행 시 아름다움에 대한 나만의 고유한 기준을 적용한다.",
        score: 0,
      },
      {
        text: "나의 업무 결과물에 대한 미적 기준은 개인적 경험과 감성에 기반을 두고 있어 다른 동료들과 다를 수 있다.",
        score: 0,
      },
      {
        text: "나는 업무와 관련된 특별한 의미를 지닌 유/무형의 소중한 자료나 작품을 수집한다.",
        score: 0,
      },
      {
        text: "나의 업무 관련 수집물은 나의 직업적 감성과 경험의 일부로 특별한 의미를 지니고 있다.",
        score: 0,
      },
      {
        text: "나는 업무 과정에서 고유한 아름다움을 발견하고 창출하려고 노력한다.",
        score: 0,
      },
      {
        text: "나는 미적 요소를 통해 업무 결과물의 질과 가치를 한층 높이는 데 기여한다.",
        score: 0,
      },
      {
        text: "나는 업무 환경에서 소소한 아름다움을 느끼는 것이 매우 중요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 일상적인 업무 순간에서도 아름다움을 발견하고 이를 나만의 방식으로 표현한다.",
        score: 0,
      },
      {
        text: "나는 내 직무 분야의 단순한 실행을 넘어 기획, 평가 등 창의적 영역으로 확장하고 싶어한다.",
        score: 0,
      },
      {
        text: "나는 업무에서의 미적 추구를 통해 나의 전문성을 더 넓게 공유하고 발전시키고 있다.",
        score: 0,
      },
      {
        text: "나는 업무에서 표면적인 결과뿐만 아니라 과정의 깊이도 매우 중요하다고 믿는다.",
        score: 0,
      },
      {
        text: "나는 업무의 표면적인 완성도를 넘어, 그 이면에 있는 의미와 가치를 탐구하는 것에 큰 의미를 둔다.",
        score: 0,
      },
      {
        text: "나는 업무 환경, 자연, 그리고 다양한 분야의 예술에서 업무에 대한 영감을 얻는다.",
        score: 0,
      },
      {
        text: "나는 업무 수행 시 혁신적이고 창의적인 아이디어를 끊임없이 만들어내려고 노력한다.",
        score: 0,
      },
      {
        text: "나는 일상적인 업무에서도 아름다움을 찾고자 하는 욕구가 있다.",
        score: 0,
      },
      {
        text: "나는 업무에서의 미적 추구를 통해 얻은 긍정적 에너지와 영감을 팀원들과 적극적으로 나누며 함께 성장하고자 한다.",
        score: 0,
      },
      {
        text: "나는 아름다움을 통해 업무의 질을 향상시키는 것에 관심이 있다.",
        score: 0,
      },
      {
        text: "나는 미적 감각을 활용하여 업무 관련 문제를 창의적으로 해결하는 것을 즐긴다.",
        score: 0,
      },
    ],
    start: "기억하다",
    advance: ["분류하다", "준비하다"],
    utility: ["구현하다", "제작하다"],
    communicate: ["공유하다", "의사소통하다"],
    expert: ["감동시키다", "유지하다"],
  },
  {
    sort: "예술 느낌형",
    name: "예술형",
    questions: [
      {
        text: "나는 업무에서 내적, 외적인 자유로움을 추구하며 이를 통해 무한한 가능성을 열어가고 있다.",
        score: 0,
      },
      {
        text: "나는 업무에서 열린 마음으로 다양한 생각을 받아들이고, 창의적인 행동을 통해 새로운 기회를 만들어가는 것을 즐긴다.",
        score: 0,
      },
      {
        text: "나는 업무를 수행하면서 '나는 어떤 전문가인가?'와 같은 근본적인 질문들을 끊임없이 한다.",
        score: 0,
      },
      {
        text: "나는 직업적 정체성에 대한 근본적 질문이 내 업무 방식 형성에 큰 영향을 미쳤다고 생각한다.",
        score: 0,
      },
      {
        text: "나에게는 업무 중 고요하게 사색할 수 있는 시간과 공간이 매우 중요하다.",
        score: 0,
      },
      {
        text: "나는 업무 중 경험하는 고독한 느낌이 내면의 소리를 듣고 창의성을 키우는 데 필수적이라고 생각한다.",
        score: 0,
      },
      {
        text: "나의 핵심적인 업무 욕구는 자신의 느낌을 표현하는 것이다.",
        score: 0,
      },
      {
        text: "나는 업무에서 내면의 감정과 생각을 외부 세계로 표출하는 과정에서 큰 만족감을 느낀다.",
        score: 0,
      },
      {
        text: "나는 내 개성과 자율성을 살려 독립적으로 업무를 수행하는 것을 선호한다.",
        score: 0,
      },
      {
        text: "나는 독립적으로 업무를 수행하여 결과물을 만들어내는 과정에서 깊은 만족과 성취를 느낀다.",
        score: 0,
      },
      {
        text: "나는 통찰력을 바탕으로 종종 팀에 혁신적인 업무 방향성을 제시한다.",
        score: 0,
      },
      {
        text: "나는 남들이 보지 못하는 각도에서 업무 문제를 바라보고, 새로운 해결책을 제안하는 것이 나의 역할이라고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무 관련 개인적인 경험이 가장 귀중한 자산이라고 믿는다.",
        score: 0,
      },
      {
        text: "나는 업무 경험이 나만의 독특한 직업적 통찰력을 만들어내는 원천이라고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무에서 독특하고 혁신적인 아이디어를 끊임없이 발굴한다.",
        score: 0,
      },
      {
        text: "나는 프로젝트에 신선한 변화와 창의적인 가치를 더하는 것을 중요하게 여긴다.",
        score: 0,
      },
      {
        text: "나는 업무 중 내 감정을 진솔하게 표현하며 소통한다.",
        score: 0,
      },
      {
        text: "나는 동료와 깊은 신뢰 관계를 구축함으로써 건강한 업무 문화를 조성하려고 노력한다.",
        score: 0,
      },
    ],
    start: "느끼다",
    advance: ["발견하다", "사색하다"],
    utility: ["창조하다", "만들다"],
    communicate: ["공연하다", "표현하다"],
    expert: ["꿈구다", "살다"],
  },
  {
    sort: "예술 융합형",
    name: "예술형",
    questions: [
      {
        text: "나는 업무에서 새로움과 혁신에 대한 강한 열망을 가지고 있다.",
        score: 0,
      },
      {
        text: "나는 업무 수행 시 기존의 틀을 벗어나 새로운 것을 창조하고 싶어 하는 욕구가 있다.",
        score: 0,
      },
      {
        text: "나는 다양한 분야의 업무 네트워크를 구축하는 것이 매우 중요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 다양한 직무 분야의 사람들과 교류하며 새로운 아이디어와 업무적 영감을 얻는다.",
        score: 0,
      },
      {
        text: "나는 업무에서 표현력뿐만 아니라 기획력에 대해서도 자신감을 가지고 있다.",
        score: 0,
      },
      {
        text: "나는 업무 아이디어를 구체화하고 실현시키는 과정에서 큰 만족감을 느낀다.",
        score: 0,
      },
      {
        text: "나는 실험적인 업무 방식이나 프로젝트를 시도하는 것에 두려움이 없다.",
        score: 0,
      },
      {
        text: "나는 업무에서 관행을 깨는 새로운 시도를 할 때 흥분과 열정을 느낀다.",
        score: 0,
      },
      {
        text: "나는 다른 직무와 비교해서 나만의 고유한 업무 기술을 개발하는 것이 필요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무에서 나만의 독특한 스타일과 전문성을 확립하는 것이 중요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 사회적, 역사적 맥락이 내 업무 방식에 중요한 영향을 미친다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 내 업무 결과물이 조직과 사회에서 어떻게 인식되고 위치하는지에 대해 고민한다.",
        score: 0,
      },
      {
        text: "나는 지속 가능한 업무 구조와 체계화에 대해 깊이 고민하고 있다.",
        score: 0,
      },
      {
        text: "나는 일시적인 성과가 아닌, 장기적으로 발전할 수 있는 업무 구조를 만들고 싶어한다.",
        score: 0,
      },
      {
        text: "나는 업무 환경의 변화와 다양한 감정의 흐름을 자연스럽게 받아들인다.",
        score: 0,
      },
      {
        text: "나는 팀의 업무 유연성과 적응력을 향상시키는 데 적극적으로 기여한다.",
        score: 0,
      },
      {
        text: "나는 각 팀원의 고유한 업무 특성을 소중히 여긴다.",
        score: 0,
      },
      {
        text: "나는 동료의 강점을 발굴하고 활용하여 팀의 업무 다양성과 창의력을 풍성하게 만든다.",
        score: 0,
      },
    ],
    start: "주목하다",
    advance: ["상상하다", "구상하다"],
    utility: ["융합하다", "연출하다"],
    communicate: ["전시하다", "보여주다"],
    expert: ["흥분시키다", "즐겁게하다"],
  },
  {
    sort: "이해 관리형",
    name: "이해형",
    questions: [
      {
        text: "나는 업무를 시작하기 전에 반드시 관련 데이터, 정보, 지식 등을 확보하려고 노력한다.",
        score: 0,
      },
      {
        text: "나는 업무 관련 데이터 확보가 안정감 있고 더 나은 결정을 내리는 데 도움이 된다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무에서 문제 해결의 인과관계와 상관관계가 중요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무 수행 시 논리적이고 수학적인 접근 방식이 내 사고의 중심에 있다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무를 위한 나만의 계획, 방안, 매뉴얼을 만든다.",
        score: 0,
      },
      {
        text: "나는 체계적인 업무 접근이 일상에 구조와 효율성을 부여한다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무 관련 리스크와 불안 요소에 민감하며, 이를 관리하는 것이 중요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 새로운 업무 방식을 만드는 것보다 기존의 것을 관리하고 개선하는 데 더 능숙하다.",
        score: 0,
      },
      {
        text: "나는 업무 관련 문제의 해결안을 만들기 위해 노력하며, 어려움에 직면해도 포기하지 않는다.",
        score: 0,
      },
      {
        text: "나는 업무 자기관리를 위해 여러 방안을 고려하고, 다양한 영역에서 성장 방법을 찾는다.",
        score: 0,
      },
      {
        text: "나는 업무 상황의 순간적 대처보다는 신중한 접근을 선호한다.",
        score: 0,
      },
      {
        text: "나는 업무에서 신중하기 때문에 깊이 있는 분석과 장기적인 시각을 가지고 있다고 생각한다.",
        score: 0,
      },
      {
        text: "나의 가장 큰 업무 강점은 성실함과 안정감이라고 생각한다.",
        score: 0,
      },
      {
        text: "나는 조직의 철학과 업무 방향에 충실하다.",
        score: 0,
      },
      {
        text: "나는 업무 관계에서 신뢰받는 것이 중요하다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무 리스크 관리가 잠재적 문제를 미리 파악하고 대비하는 데 도움이 된다고 생각한다.",
        score: 0,
      },
      {
        text: "나는 업무 문제 해결을 위해 끈기 있게 노력한다.",
        score: 0,
      },
      {
        text: "나는 체계적이고 조직적인 방법으로 업무를 관리하고 최상의 결과를 도출하려고 노력한다.",
        score: 0,
      },
    ],
    start: "알다",
    advance: ["확인하다", "설계하다"],
    utility: ["구축하다", "수정하다"],
    communicate: ["알리다", "전달하다"],
    expert: ["해결하다", "안정화시키다"],
  },
  {
    sort: "이해 연구형",
    name: "이해형",
    questions: [
      {
        text: "나는 새로운 지식과 정보를 습득하는 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 지속적인 학습과 성장이 요구되는 업무에서 만족감을 느낀다.",
        score: 0,
      },
      {
        text: "나는 세부사항에 주의를 기울여 최고 품질의 결과물을 만드는 일의 방식을 추구한다.",
        score: 0,
      },
      {
        text: "나는 감정 표현이 적은 업무 환경에서 편안함을 느낀다.",
        score: 0,
      },
      {
        text: "나는 객관성을 유지해야 하는 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 독립적이고 자율적인 업무 진행 방식을 선호한다.",
        score: 0,
      },
      {
        text: "나는 타인에 대한 의존도가 낮은 업무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 스스로 문제를 해결하고 결정을 내리는 업무 방식을 선호한다.",
        score: 0,
      },
      {
        text: "나는 분석적이고 논리적인 사고가 요구되는 문제 해결 중심의 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 정보 수집과 정리가 주요한 업무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 체계적인 자료 수집과 분류가 중요한 의사결정 과정을 포함하는 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 깊이 있는 의사소통이 필요한 업무 환경을 선호한다.",
        score: 0,
      },
      {
        text: "나는 내면적 탐구가 요구되는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 복잡한 아이디어나 개념을 다루는 업무를 즐긴다.",
        score: 0,
      },
      {
        text: "나는 독립적인 업무 공간과 시간이 보장되는 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 전문성 개발이 중요시되는 분야의 직무를 추구한다.",
        score: 0,
      },
      {
        text: "나는 다양한 주제에 대해 깊이 있는 연구가 필요한 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 불필요한 사회적 상호작용이 적은 업무 환경을 선호한다.",
        score: 0,
      },
    ],
    start: "탐색하다",
    advance: ["연구하다", "검사하다"],
    utility: ["기록하다", "개발하다"],
    communicate: ["발표하다", "설명하다"],
    expert: ["향상시키다", "정립하다"],
  },
  {
    sort: "소통 도움형",
    name: "소통형",
    questions: [
      {
        text: "나는 다양한 그룹과 쉽게 공감대를 형성하고 소통할 수 있는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 개인 간 관계 형성이 중요한 업무에서 뛰어난 성과를 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 깊고 의미 있는 관계 구축이 필요한 직무에 특별한 재능을 가지고 있다.",
        score: 0,
      },
      {
        text: "나는 적극적인 의사소통이 요구되는 업무 환경에서 좋은 평가를 받는다.",
        score: 0,
      },
      {
        text: "나는 타인에게 도움을 제공하는 것이 주요 업무인 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 타인을 지원하고 도움을 주는 업무에서 큰 보람을 느낀다.",
        score: 0,
      },
      {
        text: "나는 고객 또는 동료 중심의 업무 방식을 선호한다.",
        score: 0,
      },
      {
        text: "나는 타인의 필요와 감정에 민감하게 반응해야 하는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 문제 해결을 위한 다양한 방안을 제시하는 업무에 능숙하다.",
        score: 0,
      },
      {
        text: "나는 대화 중 상대방의 반응을 파악하는 능력이 필요한 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 비언어적 의사소통 능력이 중요한 업무 환경에서 뛰어난 성과를 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 좋은 첫인상 형성이 중요한 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 고객 서비스 관련 업무에서 뛰어난 성과를 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 팀 내 화합을 이끄는 역할이 필요한 업무 환경을 선호한다.",
        score: 0,
      },
      {
        text: "나는 타인의 잠재력을 개발하고 동기를 부여하는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 갈등 중재가 필요한 업무 상황에서 뛰어난 능력을 발휘한다.",
        score: 0,
      },
      {
        text: "나는 상담이나 멘토링 관련 직무에 관심이 있다.",
        score: 0,
      },
      {
        text: "나는 다양한 이해관계자들과의 협력이 필요한 프로젝트 중심의 업무를 즐긴다.",
        score: 0,
      },
    ],
    start: "대화하다",
    advance: ["이해하다", "공감하다"],
    utility: ["구성하다", "찾다"],
    communicate: ["돕다", "보호하다"],
    expert: ["영향을 미치다", "회복시키다"],
  },
  {
    sort: "소통 조화형",
    name: "소통형",
    questions: [
      {
        text: "나는 개인과 공동체를 포괄적으로 이해해야 하는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 안정감 있는 업무 환경을 조성하는 데 능숙하다.",
        score: 0,
      },
      {
        text: "나는 신뢰 구축이 중요한 업무에서 뛰어난 성과를 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 상황에 따른 적절한 의사소통이 필요한 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 다양한 이해관계의 균형을 유지해야 하는 업무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 조직 내 중재 역할이 필요한 직무에서 뛰어난 능력을 발휘한다.",
        score: 0,
      },
      {
        text: "나는 다양한 의견을 조율하는 업무 진행 방식에 능숙하다.",
        score: 0,
      },
      {
        text: "나는 경청과 공감 능력이 중요한 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 신중한 의사결정이 요구되는 업무 환경을 선호한다.",
        score: 0,
      },
      {
        text: "나는 장기적인 프로젝트나 끈기가 필요한 업무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 팀의 사기를 높이고 발전적인 환경을 조성하는 리더십 역할에 적합하다.",
        score: 0,
      },
      {
        text: "나는 혁신적인 해결책을 도출해야 하는 업무에 적극적으로 참여한다.",
        score: 0,
      },
      {
        text: "나는 갈등 관리와 중재가 주요한 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 팀 협력을 촉진하는 역할이 필요한 프로젝트 관리 업무에 능숙하다.",
        score: 0,
      },
      {
        text: "나는 다양한 이해관계자들의 요구를 조율하는 직무에 관심이 있다.",
        score: 0,
      },
      {
        text: "나는 고객 서비스 분야에서 원만한 업무 환경을 조성하는 데 뛰어나다.",
        score: 0,
      },
      {
        text: "나는 조직 내 부서 간 소통을 원활하게 하는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 조직의 장기적 안정과 성장을 위한 전략 수립 업무에 흥미가 있다.",
        score: 0,
      },
    ],
    start: "참여하다",
    advance: ["분석하다", "확인하다"],
    utility: ["통합하다", "중재하다"],
    communicate: ["협력하다", "상담하다"],
    expert: ["웃게하다", "조화롭게하다"],
  },
  {
    sort: "도전 확장형",
    name: "도전형",
    questions: [
      {
        text: "나는 다양한 경험을 바탕으로 새로운 접근법을 시도하는 업무 방식을 선호한다.",
        score: 0,
      },
      {
        text: "나는 지속적인 도전과 성장이 요구되는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 경쟁적인 업무 환경에서 뛰어난 성과를 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 명확한 목표 설정과 달성이 중요한 직무에서 높은 성과를 낸다.",
        score: 0,
      },
      {
        text: "나는 기획력을 바탕으로 사업을 확장하는 업무에 능숙하다.",
        score: 0,
      },
      {
        text: "나는 아이디어를 실현하고 발전시키는 프로젝트 중심의 업무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 트렌드와 환경 변화에 민감하게 대응해야 하는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 전략적 사고가 필요한 관리자급 업무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 협업을 통한 성과 창출이 중요한 업무 환경을 선호한다.",
        score: 0,
      },
      {
        text: "나는 신속한 문제 해결과 의사결정이 요구되는 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 새로운 시장 진출이나 사업 기회 발굴과 관련된 업무에 도전적이다.",
        score: 0,
      },
      {
        text: "나는 창업이나 신규 사업 개발과 관련된 직무에 관심이 있다.",
        score: 0,
      },
      {
        text: "나는 다양한 프로젝트를 동시에 관리하는 업무 방식에 능숙하다.",
        score: 0,
      },
      {
        text: "나는 영업이나 마케팅 분야의 성과 중심 직무에서 뛰어난 능력을 발휘할 수 있다.",
        score: 0,
      },
      {
        text: "나는 리더십이 요구되는 팀 관리 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 혁신적인 제품이나 서비스 개발 프로젝트를 주도하는 업무에 흥미가 있다.",
        score: 0,
      },
      {
        text: "나는 전략 기획이나 비즈니스 개발 관련 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 이해관계자 설득과 협상이 중요한 업무에서 뛰어난 성과를 낼 수 있다.",
        score: 0,
      },
    ],
    start: "탐험하다",
    advance: ["깨닫다", "기획하다"],
    utility: ["경영하다", "확장하다"],
    communicate: ["가르치다", "멘토링하다"],
    expert: ["확장하다", "활발하게하다"],
  },
  {
    sort: "도전 목표형",
    name: "도전형",
    questions: [
      {
        text: "나는 지속적인 자기 계발이 요구되는 직무를 선호한다.",
        score: 0,
      },
      {
        text: "나는 명확한 성장 목표와 성과 지표가 있는 업무 환경에서 높은 동기를 유지한다.",
        score: 0,
      },
      {
        text: "나는 체계적인 목표 설정과 달성 과정이 필요한 프로젝트 관리 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 높은 수준의 자기관리가 요구되는 자율적인 업무 환경을 선호한다.",
        score: 0,
      },
      {
        text: "나는 성과 중심의 업무 평가 시스템에서 뛰어난 실적을 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 논리적 설득이 필요한 협상이나 제안 업무에 능숙하다.",
        score: 0,
      },
      {
        text: "나는 세부적인 성과 인정 시스템이 있는 업무 환경에서 높은 만족도를 느낀다.",
        score: 0,
      },
      {
        text: "나는 팀원들의 성과를 인정하고 격려하는 리더십 역할에 적합하다.",
        score: 0,
      },
      {
        text: "나는 엄격한 일정 관리가 필요한 업무에서 뛰어난 능력을 발휘한다.",
        score: 0,
      },
      {
        text: "나는 조직의 비전을 명확히 전달하는 커뮤니케이션 업무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 도전적인 목표 설정과 달성이 요구되는 직무에서 높은 성과를 낸다.",
        score: 0,
      },
      {
        text: "나는 경쟁적인 업무 환경에서 잘 적응하고 성과를 낼 수 있다.",
        score: 0,
      },
      {
        text: "나는 성과 중심의 평가 시스템이 있는 직무에서 뛰어난 적응력을 보인다.",
        score: 0,
      },
      {
        text: "나는 업무 효율성과 생산성 향상이 중요한 직무에서 탁월한 능력을 발휘한다.",
        score: 0,
      },
      {
        text: "나는 프로젝트 관리와 목표 달성이 주요한 업무에서 뛰어난 성과를 낸다.",
        score: 0,
      },
      {
        text: "나는 조직의 성과를 극대화하는 전략 수립 및 실행 관련 직무에 적합하다.",
        score: 0,
      },
      {
        text: "나는 새로운 비즈니스 기회 발굴 및 개발과 관련된 업무에 뛰어난 능력을 보인다.",
        score: 0,
      },
      {
        text: "나는 조직의 대외 이미지 관리 및 대표 역할이 포함된 직무에 관심이 있다.",
        score: 0,
      },
    ],
    start: "도전하다",
    advance: ["생각하다", "계획하다"],
    utility: ["경쟁하다", "향상하다"],
    communicate: ["홍보하다", "컨설팅하다"],
    expert: ["성취하다", "빛내다"],
  },
];

export const verbQuestions = [
  "소스테스트 (SAUCE) 첫번째는 ‘시작 동사’입니다. 지원자님은 일 또는 아이디어를 진행할 때 어떤 ‘동사’를 기반으로 시작하나요? 포괄적이지만 자신의 일의 성향을 나타내는 동사를 골라보세요.",
  "두 번째는 ‘발전 동사’를 고를 차례입니다. 일 또는 아이디어를 시작하고 구체화,발전시킬 때 어떤 ‘동사’를 중심으로 하시나요? 정답은 없습니다. 자신에게 익숙한 동사를 골라보세요. ",
  "세 번째는 ‘기술 동사’입니다. 앞서 시작하고 발전시킨 일을 현실화 시킬 때 어떤 ‘동사’를 이용하시나요? 가장 본인이 자신있어 하는 동사를 골라보세요.",
  "네 번째 ‘소통 동사’입니다. ‘시작-발전-기술 동사로 진행 된 일이나 아이디어를 어떤 방식으로 전달, 소통하고 싶으신가요? 과거의 모습을 생각해보시고 골라보세요.",
  "마지막입니다. ‘결과 동사’를 고르시면 됩니다. 모든 과정을 지나 ‘마지막’이 어떤 모습일 때 가장 만족감이 높으실까요?",
];

export const typeDescriptions: { [key: string]: string } = {
  기준윤리형:
    "기준윤리형은 확고한 원칙과 도덕적 기준을 바탕으로 체계적이고 공정하게 일하며, 책임감과 끈기를 가지고 효율적으로 문제를 해결하는 성격 유형",
  기준심미형:
    "기준심미형은 독특한 미적 기준과 깊이 있는 통찰력을 바탕으로 일상과 업무에서 아름다움을 발견하고 창출하며, 다양한 관점을 통해 혁신적인 아이디어를 생산하고 이를 타인과 공유하는 창의적이고 감성적인 성격 유형",
  예술느낌형:
    "예술느낌형은 내면의 깊이 있는 탐구와 자유로운 사고를 바탕으로, 독창적인 아이디어를 표현하고 통찰력 있는 해결책을 제시하며, 자신의 경험과 감정을 창의적으로 외부에 표출함으로써 혁신적인 가치를 창출하고 깊은 인간관계를 형성하는 성격 유형",
  예술융합형:
    "예술융합형은 다양한 분야의 네트워크를 활용하여 혁신적인 아이디어를 발굴하고, 실험적인 접근을 통해 이를 구체화하며, 개인의 독특한 강점을 살리는 동시에 지속 가능한 시스템을 구축하여, 사회적 맥락을 고려한 창의적인 결과물을 만들어내는 방식으로 일하는 성격 유형",
  이해관리형:
    "이해관리형은 데이터와 정보를 철저히 수집하고 분석하여 논리적인 접근 방식을 취하며, 체계적인 계획과 매뉴얼을 바탕으로 리스크를 최소화하고, 기존 시스템을 안정적으로 유지하면서 점진적으로 개선하는 동시에, 장기적인 관점에서 문제 해결책을 모색하고, 맡은 업무에 대해 성실하고 책임감 있게 임하는 방식으로 일하는 성격 유형",
  이해연구형:
    "이해연구형은 강한 지적 호기심을 바탕으로 깊이 있는 지식을 추구하며, 객관적이고 논리적인 분석을 통해 문제에 접근하고, 독립적으로 연구와 탐구를 수행하면서 완벽주의적 태도로 세부사항까지 꼼꼼히 살펴보며, 내면적 성찰을 통해 통찰력을 얻고, 체계적으로 정보를 수집하고 정리하여 전문성을 바탕으로 최고 품질의 결과물을 도출하는 방식으로 일하는 성격 유형",
  소통도움형:
    "소통도움형은 뛰어난 공감 능력과 관계 구축력을 바탕으로 팀원들 간의 신뢰와 협력을 촉진하고, 경청과 감정 인지를 통해 타인의 필요를 정확히 파악하며, 조화와 포용을 추구하는 가운데 갈등을 중재하고, 긍정적인 분위기를 조성하여 동기를 부여하면서, 상황에 따라 유연하게 대응하고 창의적인 문제 해결 방안을 제시함으로써, 효과적인 의사소통과 협업을 통해 팀의 성과와 만족도를 높이는 방식으로 일하는 성격 유형",
  소통조화형:
    "소통조화형은 뛰어난 전체조망력을 바탕으로 조직 내 다양한 관계와 상황을 종합적으로 이해하고, 안정감 있는 태도로 구성원들에게 신뢰를 주며, 신중하게 상황을 파악하고 적절한 대응을 선택하면서, 다양한 의견과 입장 사이에서 균형을 유지하고 조화를 이루려 노력하며, 일단 결정한 사항에 대해서는 지속적으로 추진하는 한편, 경청과 포용력을 바탕으로 팀의 화합을 촉진하고 긍정적인 영향력을 발휘하여 조직의 전체적인 발전과 성과 향상에 기여하는 방식으로 업무를 수행하는 성격 유형",
  도전확장형:
    "도전확장형은 새로운 경험과 도전을 모험지향적으로 추구하며, 강한 경쟁심과 주도성을 바탕으로 전략적이고 거시적인 관점에서 사업을 확장하고, 뛰어난 시대감각과 직관력으로 변화에 빠르게 적응하면서, 팀워크를 중시하고 의미 있는 결과를 추구하는 가운데, 자신의 뛰어난 기획력과 신속한 의사결정 능력을 활용하여 효율적으로 문제를 해결하고 조직의 성장을 이끄는 방식으로 일하는 성격 유형",
  도전목표형:
    "도전목표형은 끊임없는 자기계발과 철저한 자기관리를 바탕으로, 명확한 목표를 설정하고 이를 달성하기 위해 시간을 최적화하여 효율적으로 업무를 수행하며, 높은 성과를 지향하면서도 작은 진전에 대해 자기인정과 격려를 통해 동기를 부여하고, 논리적이고 감성적인 설득력으로 팀원들과 소통하며, 팀의 비전을 명확히 제시하고 공유하여 모든 구성원의 성장과 성과를 이끌어내는 방식으로 일합니다.",
};
