export const applicantTypes = [
  {
    name: "기준윤리형",
    description:
      "기준윤리형은 확고한 원칙과 도덕적 기준을 바탕으로 체계적이고 공정하게 일하며, 책임감과 끈기를 가지고 효율적으로 문제를 해결하는 성격 유형",
  },
  {
    name: "기준심미형",
    description:
      "기준심미형은 독특한 미적 기준과 깊이 있는 통찰력을 바탕으로 일상과 업무에서 아름다움을 발견하고 창출하며, 다양한 관점을 통해 혁신적인 아이디어를 생산하고 이를 타인과 공유하는 창의적이고 감성적인 성격 유형",
  },
  {
    name: "예술느낌형",
    description:
      "예술느낌형은 내면의 깊이 있는 탐구와 자유로운 사고를 바탕으로, 독창적인 아이디어를 표현하고 통찰력 있는 해결책을 제시하며, 자신의 경험과 감정을 창의적으로 외부에 표출함으로써 혁신적인 가치를 창출하고 깊은 인간관계를 형성하는 성격 유형",
  },
  {
    name: "예술융합형",
    description:
      "예술융합형은 다양한 분야의 네트워크를 활용하여 혁신적인 아이디어를 발굴하고, 실험적인 접근을 통해 이를 구체화하며, 개인의 독특한 강점을 살리는 동시에 지속 가능한 시스템을 구축하여, 사회적 맥락을 고려한 창의적인 결과물을 만들어내는 방식으로 일하는 성격 유형",
  },
  {
    name: "이해관리형",
    description:
      "이해관리형은 데이터와 정보를 철저히 수집하고 분석하여 논리적인 접근 방식을 취하며, 체계적인 계획과 매뉴얼을 바탕으로 리스크를 최소화하고, 기존 시스템을 안정적으로 유지하면서 점진적으로 개선하는 동시에, 장기적인 관점에서 문제 해결책을 모색하고, 맡은 업무에 대해 성실하고 책임감 있게 임하는 방식으로 일하는 성격 유형",
  },
  {
    name: "이해연구형",
    description:
      "이해연구형은 강한 지적 호기심을 바탕으로 깊이 있는 지식을 추구하며, 객관적이고 논리적인 분석을 통해 문제에 접근하고, 독립적으로 연구와 탐구를 수행하면서 완벽주의적 태도로 세부사항까지 꼼꼼히 살펴보며, 내면적 성찰을 통해 통찰력을 얻고, 체계적으로 정보를 수집하고 정리하여 전문성을 바탕으로 최고 품질의 결과물을 도출하는 방식으로 일하는 성격 유형",
  },
  {
    name: "소통도움형",
    description:
      "소통도움형은 뛰어난 공감 능력과 관계 구축력을 바탕으로 팀원들 간의 신뢰와 협력을 촉진하고, 경청과 감정 인지를 통해 타인의 필요를 정확히 파악하며, 조화와 포용을 추구하는 가운데 갈등을 중재하고, 긍정적인 분위기를 조성하여 동기를 부여하면서, 상황에 따라 유연하게 대응하고 창의적인 문제 해결 방안을 제시함으로써, 효과적인 의사소통과 협업을 통해 팀의 성과와 만족도를 높이는 방식으로 일하는 성격 유형",
  },
  {
    name: "소통조화형",
    description:
      "소통조화형은 뛰어난 전체조망력을 바탕으로 조직 내 다양한 관계와 상황을 종합적으로 이해하고, 안정감 있는 태도로 구성원들에게 신뢰를 주며, 신중하게 상황을 파악하고 적절한 대응을 선택하면서, 다양한 의견과 입장 사이에서 균형을 유지하고 조화를 이루려 노력하며, 일단 결정한 사항에 대해서는 지속적으로 추진하는 한편, 경청과 포용력을 바탕으로 팀의 화합을 촉진하고 긍정적인 영향력을 발휘하여 조직의 전체적인 발전과 성과 향상에 기여하는 방식으로 업무를 수행하는 성격 유형",
  },
  {
    name: "도전확장형",
    description:
      "도전확장형은 새로운 경험과 도전을 모험지향적으로 추구하며, 강한 경쟁심과 주도성을 바탕으로 전략적이고 거시적인 관점에서 사업을 확장하고, 뛰어난 시대감각과 직관력으로 변화에 빠르게 적응하면서, 팀워크를 중시하고 의미 있는 결과를 추구하는 가운데, 자신의 뛰어난 기획력과 신속한 의사결정 능력을 활용하여 효율적으로 문제를 해결하고 조직의 성장을 이끄는 방식으로 일하는 성격 유형",
  },
  {
    name: "도전목표형",
    description:
      "도전목표형은 끊임없는 자기계발과 철저한 자기관리를 바탕으로, 명확한 목표를 설정하고 이를 달성하기 위해 시간을 최적화하여 효율적으로 업무를 수행하며, 높은 성과를 지향하면서도 작은 진전에 대해 자기인정과 격려를 통해 동기를 부여하고, 논리적이고 감성적인 설득력으로 팀원들과 소통하며, 팀의 비전을 명확히 제시하고 공유하여 모든 구성원의 성장과 성과를 이끌어내는 방식으로 일합니다.",
  },
];
export const verbQuestions = [
  "소스테스트 (SAUCE) 첫번째는 ‘시작 동사’입니다. 지원자님은 일 또는 아이디어를 진행할 때 어떤 ‘동사’를 기반으로 시작하나요? 포괄적이지만 자신의 일의 성향을 나타내는 동사를 골라보세요.",
  "두 번째는 ‘발전 동사’를 고를 차례입니다. 일 또는 아이디어를 시작하고 구체화,발전시킬 때 어떤 ‘동사’를 중심으로 하시나요? 정답은 없습니다. 자신에게 익숙한 동사를 골라보세요. ",
  "세 번째는 ‘기술 동사’입니다. 앞서 시작하고 발전시킨 일을 현실화 시킬 때 어떤 ‘동사’를 이용하시나요? 가장 본인이 자신있어 하는 동사를 골라보세요.",
  "네 번째 ‘소통 동사’입니다. ‘시작-발전-기술 동사로 진행 된 일이나 아이디어를 어떤 방식으로 전달, 소통하고 싶으신가요? 과거의 모습을 생각해보시고 골라보세요.",
  "마지막입니다. ‘결과 동사’를 고르시면 됩니다. 모든 과정을 지나 ‘마지막’이 어떤 모습일 때 가장 만족감이 높으실까요?",
];

export const typeDescriptions: { [key: string]: string } = {
  기준윤리형:
    "기준윤리형은 확고한 원칙과 도덕적 기준을 바탕으로 체계적이고 공정하게 일하며, 책임감과 끈기를 가지고 효율적으로 문제를 해결하는 직무 유형이다.",
  기준심미형:
    "기준심미형은 독특한 미적 기준과 깊이 있는 통찰력을 바탕으로 일상과 업무에서 아름다움을 발견하고 창출하며, 다양한 관점을 통해 혁신적인 아이디어를 생산하고 이를 타인과 공유하는 유형이다.",
  예술느낌형:
    "예술느낌형은 내면의 깊이 있는 탐구와 자유로운 사고를 바탕으로, 독창적인 아이디어를 표현하고 통찰력 있는 해결책을 제시하며, 자신의 경험과 감정을 창의적으로 외부에 표출함으로 혁신적인 가치를 창출하고 깊은 인간관계를 형성하는 유형이다.",
  예술융합형:
    "예술융합형은 다양한 분야의 네트워크를 활용하여 혁신적인 아이디어를 발굴하고, 실험적인 접근을 통해 이를 구체화하며, 개인의 독특한 강점을 살리는 동시에 지속 가능한 시스템을 구축하여, 사회적 맥락을 고려한 창의적인 결과물을 만들어내는 방식으로 일하는 유형이다.",
  이해관리형:
    "이해관리형은 데이터와 정보를 철저히 수집하고 분석하여 논리적인 접근 방식을 취하며, 체계적인 계획과 매뉴얼을 바탕으로 리스크를 최소화하고, 기존 시스템을 안정적으로 유지하면서 점진적으로 개선하는 동시에, 장기적인 관점에서 문제 해결책을 모색하고, 맡은 업무에 대해 성실하고 책임감 있게 임하는 방식으로 일하는 유형이다.",
  이해연구형:
    "이해연구형은 강한 지적 호기심을 바탕으로 깊이 있는 지식을 추구하며, 객관적이고 논리적인 분석을 통해 문제에 접근하고, 독립적으로 연구와 탐구를 수행하면서 완벽주의적 태도로 세부사항까지 꼼꼼히 살펴보며, 내면적 성찰을 통해 통찰력을 얻고, 체계적으로 정보를 수집하고 정리하여 전문성을 바탕으로 최고 품질의 결과물을 도출하는 방식으로 일하는 유형이다.",
  소통도움형:
    "소통도움형은 뛰어난 공감 능력과 관계 구축력을 바탕으로 팀원들 간의 신뢰와 협력을 촉진하고, 경청과 감정 인지를 통해 타인의 필요를 정확히 파악하며, 조화와 포용을 추구하는 가운데 갈등을 중재하고, 긍정적인 분위기를 조성하여 동기를 부여하면서, 상황에 따라 유연하게 대응하고 창의적인 문제 해결 방안을 제시함으로써, 효과적인 의사소통과 협업을 통해 팀의 성과와 만족도를 높이는 방식으로 일하는유형이다.",
  소통조화형:
    "소통조화형은 뛰어난 전체조망력을 바탕으로 조직 내 다양한 관계와 상황을 종합적으로 이해하고, 안정감 있는 태도로 구성원들에게 신뢰를 주며, 신중하게 상황을 파악하고 적절한 대응을 선택하면서, 다양한 의견과 입장 사이에서 균형을 유지하고 조화를 이루려 노력하며, 일단 결정한 사항에 대해서는 지속적으로 추진하는 한편, 경청과 포용력을 바탕으로 팀의 화합을 촉진하고 긍정적인 영향력을 발휘하여 조직의 전체적인 발전과 성과 향상에 기여하는 방식으로 업무를 수행하는 유형이다.",
  도전확장형:
    "도전확장형은 새로운 경험과 도전을 모험지향적으로 추구하며, 강한 경쟁심과 주도성을 바탕으로 전략적이고 거시적인 관점에서 사업을 확장하고, 뛰어난 시대감각과 직관력으로 변화에 빠르게 적응하면서, 팀워크를 중시하고 의미 있는 결과를 추구하는 가운데, 자신의 뛰어난 기획력과 신속한 의사결정 능력을 활용하여 효율적으로 문제를 해결하고 조직의 성장을 이끄는 방식으로 일하는 유형이다.",
  도전목표형:
    "도전목표형은 끊임없는 자기계발과 철저한 자기관리를 바탕으로, 명확한 목표를 설정하고 이를 달성하기 위해 시간을 최적화하여 효율적으로 업무를 수행하며, 높은 성과를 지향하면서도 작은 진전에 대해 자기인정과 격려를 통해 동기를 부여하고, 논리적이고 감성적인 설득력으로 팀원들과 소통하며, 팀의 비전을 명확히 제시하고 공유하여 모든 구성원의 성장과 성과를 이끌어내는 방식으로 일하는 유형이다.",
};

export const keyword = [
  { name: "기준윤리형", keyword: ["책임감", "원칙주의", "정직성"] },
  { name: "기준심미형", keyword: ["감성적", "혁신적", "직관적"] },
  { name: "예술느낌형", keyword: ["독창성", "표현력", "자유로움"] },
  { name: "예술융합형", keyword: ["다양성", "실험정신", "융합성"] },
  { name: "이해관리형", keyword: ["체계적", "신중함", "성실성"] },
  { name: "이해연구형", keyword: ["논리중심", "객관성", "탐구열정"] },
  { name: "소통도움형", keyword: ["협력적", "적응력", "감성인지"] },
  { name: "소통조화형", keyword: ["중재력", "인내심", "안정감"] },
  { name: "도전확장형", keyword: ["모험적", "전략적", "주도적"] },
  { name: "도전목표형", keyword: ["추진력", "영향력", "효율성"] },
];
